app/controllers/photos_controller.rb

INSERT INTO "photos" ("created_at", "updated_at", "file_file_name", "file_content_type", "file_file_size", "file_updated_at") VALUES ('2012-05-28 05:49:02.914251', '2012-05-28 05:49:02.914251', '340430_2587898698378_1281873955_2031915_653566006_o.jpg', '[image/jpeg]', 495392, '2012-05-28 05:49:01.866266')
---
  def create
    @photo = Photo.new
    @photo.file = params[:file] if params.has_key?(:file)
    # detect Mime-Type (mime-type detection doesn't work in flash)
    @photo.file_content_type = MIME::Types.type_for(params[:name]).to_s if params.has_key?(:name)
    @photo.save!